In [1]:
import pandas as pd
order = pd.read_table('./data/meal_order_info.csv',sep = ',',encoding = 'gbk')
print('进行转换前订单信息表lock_time的类型为：', order['lock_time'].dtypes)
order['lock_time'] = pd.to_datetime(order['lock_time'])
print('进行转换后订单信息表lock_time的类型为：', order['lock_time'].dtypes)

进行转换前订单信息表lock_time的类型为： object
进行转换后订单信息表lock_time的类型为： datetime64[ns]

In [2]:
print('最小时间为：', pd.Timestamp.min)
print('最大时间为：', pd.Timestamp.max)

最小时间为： 1677-09-21 00:12:43.145225
最大时间为： 2262-04-11 23:47:16.854775807

In [4]:
dateIndex = pd.DatetimeIndex(order['lock_time'])
print('转换为DatetimeIndex后数据的类型为：\n',type(dateIndex))

转换为DatetimeIndex后数据的类型为：
 <class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [5]:
dateIndex

DatetimeIndex(['2016-08-01 11:11:46', '2016-08-01 11:31:55',
               '2016-08-01 12:54:37', '2016-08-01 13:08:20',
               '2016-08-01 13:07:16', '2016-08-01 13:23:42',
               '2016-08-01 13:34:18', '2016-08-01 13:50:16',
               '2016-08-01 17:18:20', '2016-08-01 17:44:27',
               ...
               '2016-08-31 18:18:31', '2016-08-31 18:42:42',
               '2016-08-31 18:57:56', '2016-08-31 19:19:31',
               '2016-08-31 20:39:13', '2016-08-31 21:31:48',
               '2016-08-31 21:56:12', '2016-08-31 21:33:34',
               '2016-08-31 21:55:39', '2016-08-31 21:32:56'],
              dtype='datetime64[ns]', name='lock_time', length=945, freq=None)

In [6]:
periodIndex = pd.PeriodIndex(order['lock_time'],freq = 'S')
print('转换为DatetimeIndex后数据的类型为：\n',type(periodIndex))

转换为DatetimeIndex后数据的类型为：
 <class 'pandas.core.indexes.period.PeriodIndex'>

In [7]:
periodIndex

PeriodIndex(['2016-08-01 11:11:46', '2016-08-01 11:31:55',
             '2016-08-01 12:54:37', '2016-08-01 13:08:20',
             '2016-08-01 13:07:16', '2016-08-01 13:23:42',
             '2016-08-01 13:34:18', '2016-08-01 13:50:16',
             '2016-08-01 17:18:20', '2016-08-01 17:44:27',
             ...
             '2016-08-31 18:18:31', '2016-08-31 18:42:42',
             '2016-08-31 18:57:56', '2016-08-31 19:19:31',
             '2016-08-31 20:39:13', '2016-08-31 21:31:48',
             '2016-08-31 21:56:12', '2016-08-31 21:33:34',
             '2016-08-31 21:55:39', '2016-08-31 21:32:56'],
            dtype='period[S]', name='lock_time', length=945, freq='S')

In [10]:
year1 = [i.year for i in order['lock_time']]
print('lock_time中的年份数据前5个为：',year1[:5])
month1 = [i.month for i in order['lock_time']]
print('lock_time中的月份数据前5个为：',month1[:5])
day1 = [i.day for i in order['lock_time']]
print('lock_time中的日期数据前5个为：',day1[:5])
weekday1 = [i.day_name() for i in order['lock_time']]
print('lock_time中的星期名称数据前5个为：',weekday1[:5])

lock_time中的年份数据前5个为： [2016, 2016, 2016, 2016, 2016]
lock_time中的月份数据前5个为： [8, 8, 8, 8, 8]
lock_time中的日期数据前5个为： [1, 1, 1, 1, 1]
lock_time中的星期名称数据前5个为： ['Monday', 'Monday', 'Monday', 'Monday', 'Monday']

In [19]:
print('dateIndex中的星期名称数据前5个为：\n',
      dateIndex.day_name()[:5])
print('periodIndex中的星期标号数据前5个为：',
      periodIndex.weekday[:5])

dateIndex中的星期名称数据前5个为：
 Index(['Monday', 'Monday', 'Monday', 'Monday', 'Monday'], dtype='object', name='lock_time')
periodIndex中的星期标号数据前5个为： Int64Index([0, 0, 0, 0, 0], dtype='int64', name='lock_time')

In [20]:
## 将lock_time数据向后平移一天
time1 = order['lock_time']+pd.Timedelta(days = 1) 
print('lock_time在加上一天前前5行数据为：\n',order['lock_time'][:5])
print('lock_time在加上一天前前5行数据为：\n',time1[:5])

lock_time在加上一天前前5行数据为：
 0   2016-08-01 11:11:46
1   2016-08-01 11:31:55
2   2016-08-01 12:54:37
3   2016-08-01 13:08:20
4   2016-08-01 13:07:16
Name: lock_time, dtype: datetime64[ns]
lock_time在加上一天前前5行数据为：
 0   2016-08-02 11:11:46
1   2016-08-02 11:31:55
2   2016-08-02 12:54:37
3   2016-08-02 13:08:20
4   2016-08-02 13:07:16
Name: lock_time, dtype: datetime64[ns]

In [21]:
timeDelta = order['lock_time'] - pd.to_datetime('2017-1-1')
print('lock_time减去2017年1月1日0点0时0分后的数据：\n',
      timeDelta[:5])
print('lock_time减去time1后的数据类型为：',timeDelta.dtypes)

lock_time减去2017年1月1日0点0时0分后的数据：
 0   -153 days +11:11:46
1   -153 days +11:31:55
2   -153 days +12:54:37
3   -153 days +13:08:20
4   -153 days +13:07:16
Name: lock_time, dtype: timedelta64[ns]
lock_time减去time1后的数据类型为： timedelta64[ns]

In [22]:
import pandas as pd
order = pd.read_table('./data/meal_order_info.csv',
      sep = ',',encoding = 'gbk')
order['use_start_time'] = pd.to_datetime(order['use_start_time'])
order['lock_time'] = pd.to_datetime(order['lock_time'])
print('进行转换后订单信息表use_start_time和lock_time的类型为：\n', 
      order[['use_start_time','lock_time']].dtypes)

进行转换后订单信息表use_start_time和lock_time的类型为：
 use_start_time    datetime64[ns]
lock_time         datetime64[ns]
dtype: object

In [24]:
year = [i.year for i in order['lock_time']]## 提取年份信息
month = [i.month for i in order['lock_time']]## 提取月份信息
day = [i.day for i in  order['lock_time']]## 提取日期信息
week = [i.week for i in  order['lock_time']]## 提取周信息
weekday = [i.weekday() for i in  order['lock_time']]##提取星期信息
## 提取星期名称信息
weekname = [i.day_name() for i in  order['lock_time']]
print('订单详情表中的前5条数据的年份信息为：',year[:5])
print('订单详情表中的前5条数据的月份信息为：',month[:5])
print('订单详情表中的前5条数据的日期信息为：',day[:5])
print('订单详情表中的前5条数据的周信息为：',week[:5])
print('订单详情表中的前5条数据的星期信息为：',weekday[:5])
print('订单详情表中的前5条数据的星期名称信息为：',weekname[:5])

订单详情表中的前5条数据的年份信息为： [2016, 2016, 2016, 2016, 2016]
订单详情表中的前5条数据的月份信息为： [8, 8, 8, 8, 8]
订单详情表中的前5条数据的日期信息为： [1, 1, 1, 1, 1]
订单详情表中的前5条数据的周信息为： [31, 31, 31, 31, 31]
订单详情表中的前5条数据的星期信息为： [0, 0, 0, 0, 0]
订单详情表中的前5条数据的星期名称信息为： ['Monday', 'Monday', 'Monday', 'Monday', 'Monday']

In [25]:
timemin = order['lock_time'].min()
timemax = order['lock_time'].max()
print('订单最早的时间为：',timemin)
print('订单最晚的时间为：',timemax)
print('订单持续的时间为：',timemax-timemin)

chekTime = order['lock_time'] - order['use_start_time']
print('平均点餐时间为：',chekTime.mean())
print('最小点餐时间为：',chekTime.min())
print('最大点餐时间为：',chekTime.max())

订单最早的时间为： 2016-08-01 11:11:46
订单最晚的时间为： 2016-08-31 21:56:12
订单持续的时间为： 30 days 10:44:26
平均点餐时间为： 0 days 01:12:10.326923076
最小点餐时间为： -1 days +00:05:03
最大点餐时间为： 16 days 00:08:00

In [26]:
df1 = pd.DataFrame({'A': ['A1', 'A2', 'A3', 'A4'], 'B': ['B1', 'B2', 'B3', 'B4'],'C': ['C1', 'C2', 'C3', 'C4'],'D': ['D1', 'D2', 'D3', 'D4']},index=[1, 2, 3, 4])
df2 = pd.DataFrame({'B': ['B2', 'B4', 'B6', 'B8'],'D': ['D2', 'D4', 'D6', 'D8'],'F': ['F2', 'F4', 'F6', 'F8']},index=[2, 4, 6, 8])
df1

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [27]:
df2

    B   D   F
2  B2  D2  F2
4  B4  D4  F4
6  B6  D6  F6
8  B8  D8  F8

In [33]:
pd.concat([df1,df2],axis=1,join='inner',sort=False)

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
4  A4  B4  C4  D4  B4  D4  F4

In [34]:
pd.concat([df1,df2],axis=1,join='outer',sort=False)

     A    B    C    D    B    D    F
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3  NaN  NaN  NaN
4   A4   B4   C4   D4   B4   D4   F4
6  NaN  NaN  NaN  NaN   B6   D6   F6
8  NaN  NaN  NaN  NaN   B8   D8   F8

In [35]:
pd.concat([df1,df2],axis=0,join='inner',sort=False)

    B   D
1  B1  D1
2  B2  D2
3  B3  D3
4  B4  D4
2  B2  D2
4  B4  D4
6  B6  D6
8  B8  D8

In [36]:
pd.concat([df1,df2],axis=0,join='outer',sort=False)

     A   B    C   D    F
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4   A4  B4   C4  D4  NaN
2  NaN  B2  NaN  D2   F2
4  NaN  B4  NaN  D4   F4
6  NaN  B6  NaN  D6   F6
8  NaN  B8  NaN  D8   F8

In [37]:
df1 = pd.DataFrame({'key':list('bbaca'),'data1':range(5)})
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4

In [38]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [39]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0

In [40]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0

In [41]:
pd.merge(df1,df2,left_on='key',right_on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0

In [42]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   a    2.0    0.0
3   a    4.0    0.0
4   c    3.0    NaN
5   d    NaN    2.0

In [43]:
pd.merge(df1,df2,how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0

In [44]:
pd.merge(df1,df2,left_on='data1',right_index=True)

  key_x  data1 key_y  data2
0     b      0     a      0
1     b      1     b      1
2     a      2     d      2

In [45]:
pd.merge(df1,df2,left_on='data1',right_index=True,suffixes=('_df1','_df2'))

  key_df1  data1 key_df2  data2
0       b      0       a      0
1       b      1       b      1
2       a      2       d      2

In [47]:
import numpy as np
dict1 = {'ID':[1,2,3,4,5,6,7,8,9],'System':['win10','win10',np.nan,'win10',np.nan,np.nan,'win7','win7','win8'],'cpu':['i7','i5',np.nan,'i7',np.nan,np.nan,'i5','i5','i3']}
dict2 = {'ID':[1,2,3,4,5,6,7,8,9],'System':[np.nan,np.nan,'win7',np.nan,'win8','win7',np.nan,np.nan,np.nan],'cpu':[np.nan,np.nan,'i3',np.nan,'i7','i5',np.nan,np.nan,np.nan]}
## 转换两个字典为DataFrame
df5 = pd.DataFrame(dict1)
df5

   ID System  cpu
0   1  win10   i7
1   2  win10   i5
2   3    NaN  NaN
3   4  win10   i7
4   5    NaN  NaN
5   6    NaN  NaN
6   7   win7   i5
7   8   win7   i5
8   9   win8   i3

In [48]:
df6 = pd.DataFrame(dict2)
df6

   ID System  cpu
0   1    NaN  NaN
1   2    NaN  NaN
2   3   win7   i3
3   4    NaN  NaN
4   5   win8   i7
5   6   win7   i5
6   7    NaN  NaN
7   8    NaN  NaN
8   9    NaN  NaN

In [52]:
print('经过重叠合并后的数据为：')
df5.combine_first(df6)

经过重叠合并后的数据为：

   ID System cpu
0   1  win10  i7
1   2  win10  i5
2   3   win7  i3
3   4  win10  i7
4   5   win8  i7
5   6   win7  i5
6   7   win7  i5
7   8   win7  i5
8   9   win8  i3